// сделала объект

let json = `[{
    "img": "https://n1s1.hsmedia.ru/13/a5/b2/13a5b2373d5e23489d9a4949ada5b927/547x397_0xac120002_8752067681540468870.jpg",
        "name": "Бэтмен",
        "universe": "DC Comics",
        "alterEgo": "Брюс Уэйн",
        "class": "борец с преступностью, филантроп, миллиардер",
        "friends": "Робин, Бэдгерл",
        "superPowers": "интеллект, обширные познания, знания боевых искусств, ловкость",
        "info": "по популярности человек-летучая мышь может сравниться только с Суперменом. Его образ кажется очень мистическим и мрачным: черный костюм с развевающимся плащом, устрашающий Бэтмобиль, штаб-квартира в сырой пещере. Его биография настолько же темна, как и образ. В детстве у него на глазах убили родителей, и юный Брюс поклялся всеми силами защищать родной Готэм от преступности. Брюс знаменит, несмотря на пожилой возраст: первый выпуск с его участием вышел аж в 1939 году. С каждым годом популярность только крепнет. Большую роль в этом сыграли экранизации: «Темный рыцарь», сериал «Готэм» и несколько одноименных картин. Главная причина такой любви среди фанатов — мысль, что каждый может стать Бэтменом. Если подумать, это один из немногих героев, кто добился своего положения за счет ума и упорства, а не за счет мутаций."
    },

    {
        "img": "https://n1s1.hsmedia.ru/06/d3/73/06d37321618034ec5f2a65b09c8576e3/547x397_0xac120002_45567661540468871.jpg",        
        "name": "Супермен",
        "universe": "DC Comics",
        "alterEgo": "Кларк Кент",
        "class": "борец за справедливость",
        "friends": "собака Крипто",
        "superPowers": "непробиваемость, суперсила, полет, самоисцеление, суперзрение и суперслух, классный костюм",
        "info": "полная противоположность своему противнику Бэтмену. Если Брюс Уэйн был простым человеком и стал героем, то Супермен героем родился, но вынужден был изображать выходца из бедной канзасской семьи. Последний представитель планеты Криптон был отправлен на Землю прямо перед тем, как его родина была уничтожена.  Супермен — некий хамелеон от мира комиксов. В своем первом выпуске в 1938 году он был просто человек-огромный мускул, который умел только разбивать стены и выбивать двери. Позднее к его умениям добавилась способность летать. Дальше у многочисленных воплощений Кларка, от подростка в «Тайнах Смоллвиля» до величественного «Человека из стали», разный уровень и количество суперспособностей. Неизменным остается его слабое место — уязвимость к Криптониту, радиоактивному веществу с родной планеты."
    },
    {
        "img": "https://n1s1.hsmedia.ru/7b/56/08/7b5608ec3df83d872fa1162fb9e32f28/547x397_0xac120002_1773711401540468871.jpg",
        "name": "Железный человек",
        "universe": "Marvel Comics",
        "alterEgo": "Тони Старк",
        "class": "гений, миллиардер, плейбой, филантроп",
        "friends": "Мстители",
        "superPowers": "непробиваемость, суперсила, полет, самоисцеление, суперзрение и суперслух, классный костюм",
        "info": "пожалуй, самый популярный современный супергерой. У него много общего с мрачной птицей ночи Бэтменом: оба потеряли родителей в детстве, стали борцами с преступностью без особых сверхсил, невероятно богатые. Только если Бэтменом восхищаются, то Тони Старка — обожают :) То ли дело в шикарной актерской игре Роберта Дауни мл., который выбил роль у Николаса Кейджа и Тома Круза, то ли в хорошо прописанном персонаже. Прототипом для героя послужили Илон Маск и изобретатель Говард Хьюз. Железный Человек не всегда ходил в красном модном костюме: в своих первых версиях 1963 года он был скромного серого цвета. Увы, в киновоплощении бронекостюм даже не из металла — его делали из пластика и стекловолокна."
    },
    {
        "img": "https://n1s1.hsmedia.ru/37/39/74/373974effcc7ccd093d849e8fa062091/547x397_0xac120002_9548247751540468871.jpg",
        "name": "Спайдер-мен/Человек-паук",
        "universe": "Marvel Comics",
        "alterEgo": "Питер Паркер",
        "class": "борец за справедливость, студент, фотограф",
        "friends": "Мстители, Фантастическая четверка, Люди Икс",
        "superPowers": "сверхчеловеческие рефлексы, «паучье чутье», способность прилепляться к твердым поверхностям, производство паутины",
        "info": "Человек-паук родился от потребности Marvel Comics создать героя-подростка. Другие супергерои вроде Бэтмена и Супермена — взрослые мужчины, и целевая аудитория не видела в них примеры для подражания. Пятнадцатилетний Питер Паркер дал понять всем тинейджерам Земли, что можно и злодеев уничтожить, и на красавице жениться. Для этого даже не обязательно быть суперкрасавчиком! Всего лишь нужен укус паучка: Питер не сразу использовал свои силы во благо людей: изначально он хотел делать на них деньги, участвуя в нелегальных боях без правил. Затем его любимый дядя Бен умер от рук грабителя, и подросток поклялся, что очистит свой родной Нью-Йорк ото зла. Однако спустя время подросток понял, что одной клятвы недостаточно и что «с великой силой приходит великая ответственность». Кстати, не все суперсилы у Питера появились за счет мутации: парень самостоятельно взломал технологию Тони Старка, после чего заслужил его признание. "
    },

    {
        "img": "https://n1s1.hsmedia.ru/87/ed/c5/87edc525d8813c7b2899e04a4e562fe9/547x397_0xac120002_6444132261540468872.jpg",
        "name": "Чудо-женщина",
        "universe": "DC Comics",
        "alterEgo": "Диана Принсе",
        "class": "супергероиня, секретарь-референт",
        "friends": "Лига Справедливости, Бэтмен, Супермен",
        "superPowers": "сверхчеловеческая сила искорость, выносливость, полет",
        "info": "пора бы разбавить эту мужскую вечеринку по-настоящему крутой девчонкой :) Принцесса-амозонка родилась на мистическом острове Темескира, расположенном в центре Бермудского треугольника, где пропадают самолеты. Свое настоящее имя — Диана — она получила в честь древнегреческой богини охоты, а суперспособности — от богини любви Афродиты. Растили героиню в исключительно женском обществе, поэтому Чудо-женщина часто появляется в культуре как символ феминизма.У Дианы есть супер-снаряжение: лассо истины и тиара. Первое было сковано богом огня Гефестом, и оно никогда не промахивается. Человек, попавший в его петлю, неизбежно расскажет свои секреты, вспомнит забытое и даже подчинится приказам. Тиара же работает как метательное оружие, способное рассечь что угодно. Корона со звездой в центре символизирует патриотизм американской героини и служит стильным аксессуаром "
    },
    {
        "img": "https://n1s1.hsmedia.ru/e0/2b/55/e02b55b147eeaff9b3fe6bdbb36ff9ea/547x397_0xac120002_744074131540468872.jpg",
        "name": "Дедпул",
        "universe": "Marvel Comics",
        "alterEgo": "Уэйд Уинстон Уилсон",
        "class": "антигерой, наемник",
        "friends": "частично Мстители, Человек-паук, Росомаха",
        "superPowers": "высокий болевой порог, регенерация и бессмертие, сверхчеловеческая иммунная система",
        "info": "как и Росомаха из Людей Икс, Дэдпул был подвергнут опытам по программе «Оружие Икс». Ученые попытались исцелить его рак, привив его клеткам способность к регенерации. Как и всегда в комиксах, что-то пошло не так, и Дэдпул остался изуродованным и психически нестабильным. Это единственный супергерой из списка, который однозначно не на стороне добра. Дэдпул наслаждается насилием. Первоначально появившись в основной Вселенной Marvel, он получил альтернативные варианты в других реальностях Мультивселенной. Что оставалось неизменным — его циничное, черное чувство юмора: за него Дэдпула прозвали «Болтливым наемником»"
    }
]`;

// добавляю функцию при загрузке страницы выводить карточки

document.addEventListener("DOMContentLoaded", function (event) {
    // парсинг
    let comics = JSON.parse(json);
    console.log(comics);
    // создаем  место для героев
    let boxingForHeroes = "";

    // заполняем карточки героями

    for (let card of comics) {
        boxingForHeroes +=`<div class="cardHeroes">
        <img class="img" alt="picture" src='${card.img}'>
        <h2> ${card.name}</h2>
        <p><span class ="highlight"> Вселенная:</span> ${card.universe}</p>
        <p> <span class ="highlight"> Альтер эго:</span> ${card.alterEgo}</p>
        <p> <span class ="highlight">Род деятельности:</span> ${card.class}</p>
        <p> <span class ="highlight">Друзья: </span>${card.friends}</p>
        <p> <span class ="highlight">Суперсилы:</span> ${card.superPowers}</p>
        <p><span class ="highlight">Подробнее:</span>  ${card.info}</p>
        </div>`

    }
    // выводим карточки в див
    document.querySelector(".container").innerHTML = boxingForHeroes;
});
